# NumberOfUGridlines Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedSurface..::..NumberOfUGridlines Property
DividedSurface Class See Also
---
Get the number of U-gridlines used on the surface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int NumberOfUGridlines { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfUGridlines As Integer
	Get
```

Visual C++
---
```text
public:
property int NumberOfUGridlines {
	int get ();
}
```

# See Also
DividedSurface Class
Autodesk.Revit.DB Namespace